#-*-coding:utf-8-*-
#author:PeterGu
#e-mail:gucaca@yeah.net

#题目：企业发放的奖金根据利润提成。利润(I)
#低于或等于10万元时，奖金可提10%；
#利润高于10万元，低于20万元时，低于10万元的部分按10%提成，高于10万元的部分，可提成7.5%；
#20万到40万之间时，高于20万元的部分，可提成5%；
#40万到60万之间时高于40万元的部分，可提成3%；
#60万到100万之间时，高于60万元的部分，可提成1.5%，
#高于100万元时，超过100万元的部分按1%提成，
#从键盘输入当月利润I，求应发放奖金总数？


profit = input(u'请收入当月整数利润额（单位：万）：')

profit_num = int(profit)

if profit_num < 10:
	print(u'发放奖金数为：',profit_num*0.1)
elif profit_num < 20:
	print(u'发放奖金数为：',10*0.1+(profit_num-10)*0.075)
elif profit_num < 40:
	print(u'发放奖金数为：',10*0.1+10*0.075+(profit_num-20)*0.05)
elif profit_num < 60:
	print(u'发放奖金数为：',10*0.1+10*0.075+20*0.05+(profit_num-40)*0.03)
elif profit_num < 100:
	print(u'发放奖金数为：',10*0.1+10*0.075+20*0.05+20*0.03+(profit_num-60)*0.015)
else:
	print(u'发放奖金数为：',10*0.1+10*0.075+20*0.05+20*0.03+40*0.015+(profit_num-100)*0.01)

